from flask import Blueprint, render_template, request, abort

lab7 = Blueprint('lab7', __name__)

@lab7.route('/lab7/')
def main():
    return render_template('lab7/lab7.html')


films = [
    {
        "title": "Fight Club",
        "title_ru": "Бойцовский клуб",
        "year": 1999,
        "description": "Сотрудник страховой компании страдает хронической бессонницей \
            и отчаянно пытается вырваться из мучительно скучной жизни. Однажды в \
            очередной командировке он встречает некоего Тайлера Дёрдена — харизматического \
            торговца мылом с извращенной философией. Тайлер уверен, что \
            самосовершенствование — удел слабых, а единственное, ради чего стоит \
            жить, — саморазрушение. \
            Проходит немного времени, и вот уже новые друзья лупят друг друга почем зря \
            на стоянке перед баром, и очищающий мордобой доставляет им высшее блаженство. \
            Приобщая других мужчин к простым радостям физической жестокости, они основывают \
            тайный Бойцовский клуб, который начинает пользоваться невероятной популярностью."
    },
    {
        "title": "The Dark Knight",
        "title_ru": "Темный рыцарь",
        "year": 2008,
        "description": "Бэтмен поднимает ставки в войне с криминалом. С помощью лейтенанта \
            Джима Гордона и прокурора Харви Дента он намерен очистить улицы Готэма от \
            преступности. Сотрудничество оказывается эффективным, но скоро они обнаружат себя \
            посреди хаоса, развязанного восходящим криминальным гением, известным напуганным \
            горожанам под именем Джокер."
    },
    {
        "title": "Coco",
        "title_ru": "Тайна Коко",
        "year": 2017,
        "description": "12-летний Мигель живёт в мексиканской деревушке в семье сапожников \
            и тайно мечтает стать музыкантом. Тайно, потому что в его семье музыка считается \
            проклятием. Когда-то его прапрадед оставил жену, прапрабабку Мигеля, ради мечты, \
            которая теперь не даёт спокойно жить и его праправнуку. С тех пор музыкальная \
            тема в семье стала табу. Мигель обнаруживает, что между ним и его любимым певцом \
            Эрнесто де ла Крусом, ныно покойным, существует некая связь. Паренёк отправляется \
            к своему кумиру в Страну Мёртвых, где встречает души предков. Мигель знакомится \
            там с духом-скелетом по имени Гектор, который становится его проводником. Вдвоём \
            они отправляются на поиски де ла Круса."
    },
    {
        "title": "Harry Potter and the Sorcerer's Stone",
        "title_ru": "Гарри Поттер и философский камень",
        "year": 2001,
        "description": "Жизнь десятилетнего Гарри Поттера нельзя назвать сладкой: родители умерли, \
            едва ему исполнился год, а от дяди и тёти, взявших сироту на воспитание, достаются лишь \
            тычки да подзатыльники. Но в одиннадцатый день рождения Гарри всё меняется. Странный \
            гость, неожиданно появившийся на пороге, приносит письмо, из которого мальчик узнаёт, \
            что на самом деле он - волшебник и зачислен в школу магии под названием Хогвартс. А \
            уже через пару недель Гарри будет мчаться в поезде Хогвартс-экспресс навстречу новой \
            жизни, где его ждут невероятные приключения, верные друзья и самое главное — ключ к \
            разгадке тайны смерти его родителей."
    },
    {
        "title": "The Matrix",
        "title_ru": "Матрица",
        "year": 1999,
        "description": "Жизнь Томаса Андерсона разделена на две части: днём он — самый обычный \
            офисный работник, получающий нагоняи от начальства, а ночью превращается в хакера \
            по имени Нео, и нет места в сети, куда он бы не смог проникнуть. Но однажды всё \
            меняется. Томас узнаёт ужасающую правду о реальности."
    },
]


@lab7.route('/lab7/rest-api/films/', methods=['GET'])
def get_films():
    return films


@lab7.route('/lab7/rest-api/films/<int:id>', methods=['GET'])
def get_film(id):
    if id < 0 or id >= len(films):
        abort(404)
    return films[id]


@lab7.route('/lab7/rest-api/films/<int:id>', methods=['DELETE'])
def del_film(id):
    if id < 0 or id >= len(films):
        abort(404)
    del films[id]
    return '', 204


@lab7.route('/lab7/rest-api/films/<int:id>', methods=['PUT'])
def put_film(id):
    if id < 0 or id >= len(films):
        abort(404)
    film = request.get_json()
    
    if not film.get('description') or film['description'].strip() == '':
        return {'description': 'Заполните описание'}, 400
    
    films[id] = film
    return films[id]


@lab7.route('/lab7/rest-api/films/', methods=['POST'])
def add_film():
    film = request.get_json()
    
    if not film or 'title' not in film or 'title_ru' not in film or 'year' not in film or 'description' not in film:
        abort(400, 'Missing required fields')
    
    if not film.get('description') or film['description'].strip() == '':
        return {'description': 'Заполните описание'}, 400
    
    films.append(film)
    
    return {'id': len(films) - 1}, 201